# pandas Basics

- In this homework assignment, you will practice selecting, sorting, and aggregating data in a DataFrame. 
- Follow each *TODO* instruction to write a Python code snippet with pandas and Numpy. Include the output of each code cell.

In [255]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

**TODO 1**
Consider the following Python dictionary `adict`. 

```python
adict = {'state': ['New York', 'California', 'Maryland'], 
         'pop2010': [19378, 37254, 5774],
         'pop2018': [19542, 39557, 6043],
         'rev2010': [71545, 112372, 17064],
         'rev2018': [88541, 175017, 22427]}
```

Notation:

- `pop2010`: state's 2010 population (in thousand)
- `pop2018`: state's 2018 population (in thousand)
- `rev2010`: state's 2010 tax revenue (in million USD)
- `rev2018`: state's 2018 tax revenue (in million USD)

Construct a DataFrame `frame` from dictionary `adict`. The row label (index) of each state is its abbreviation, i.e., `NY`, `CA` or `MD`.

In [256]:
#####TODO 1#####
pass

adict = {'State':['New York','California','Maryland'],
        'pop 2010': [19378, 37254, 5774],
        'pop 2018': [19542, 39557, 6043],
        'rev 2010': [71545, 112372, 17064],
        'rev 2018': [88541, 175017, 22427]}
frame = DataFrame(adict)
frame

frame = DataFrame(adict, columns = ['State', 'pop 2010', 'pop 2018', 'rev 2010', 'rev 2018'], 
                    index = ['NY', 'CA','MD'])
frame

         State  pop 2010  pop 2018  rev 2010  rev 2018
NY    New York     19378     19542     71545     88541
CA  California     37254     39557    112372    175017
MD    Maryland      5774      6043     17064     22427

**TODO 2**
It is known that the areas of the three states are 54555, 163695 and 12406 square miles. Add a column `area` with appropriate data to DataFrame `frame`.

In [257]:
#####TODO 2#####
pass
frame = DataFrame(adict, columns = ['State', 'pop 2010', 'pop 2018', 'rev 2010', 'rev 2018','area'], 
                    index = ['NY', 'CA','MD'])
frame

area = Series([54555, 163695, 12406], 
                 index = ['NY', 'CA', 'MD'])
frame['area'] = area
frame

         State  pop 2010  pop 2018  rev 2010  rev 2018    area
NY    New York     19378     19542     71545     88541   54555
CA  California     37254     39557    112372    175017  163695
MD    Maryland      5774      6043     17064     22427   12406

**TODO 3** 
Select the first row and the last row of DataFrame `frame`.

In [258]:
#####TODO 3#####
pass

print(frame.loc[['NY', 'MD']])

       State  pop 2010  pop 2018  rev 2010  rev 2018   area
NY  New York     19378     19542     71545     88541  54555
MD  Maryland      5774      6043     17064     22427  12406

**TODO 4**
Select just columns `state`, `pop2018` and `area` from DataFrame `frame`.

In [259]:
#####TODO 4#####
pass
print(frame[['State', 'pop 2018', 'area']])

         State  pop 2018    area
NY    New York     19542   54555
CA  California     39557  163695
MD    Maryland      6043   12406

**TODO 5**
Select the New York state's population data in 2010 and 2018.

In [260]:
#####TODO 5#####
pass
frame.loc[['NY'],['pop 2010', 'pop 2018']]

    pop 2010  pop 2018
NY     19378     19542

**TODO 6**
Show the row labels of the second row and the third row.

In [261]:
#####TODO 6#####
pass
frame.index[1:3]

Index(['CA', 'MD'], dtype='object')

**TODO 7**
Select just columns `state`, `rev2010` and `rev2018` of the second row and the third row from DataFrame `frame`.

In [262]:
#####TODO 7#####
pass

print(frame[['State', 'rev 2010']])
frame.loc[['CA','MD'],['rev 2018']]

         State  rev 2010
NY    New York     71545
CA  California    112372
MD    Maryland     17064

    rev 2018
CA    175017
MD     22427

**TODO 8** Select only the rows from DataFrame `frame` with an area greater than 50,000.

In [263]:
#####TODO 8#####
pass

frame['area'] > 50000

NY     True
CA     True
MD    False
Name: area, dtype: bool

**TODO 9** 
Add a column `popchange` to DataFrame `frame`. Assign the percentage change from 2010 to 2018 in each state's population to this new column.

In [264]:
#####TODO 9#####
pass

frame['popchange'] = ((frame['pop 2018'] - frame['pop 2010']) / frame['pop 2010'] * 100)

frame

         State  pop 2010  pop 2018  rev 2010  rev 2018    area  popchange
NY    New York     19378     19542     71545     88541   54555   0.846321
CA  California     37254     39557    112372    175017  163695   6.181887
MD    Maryland      5774      6043     17064     22427   12406   4.658815

**TODO 10** 
Sort DataFrame `frame` by the index.

In [265]:
#####TODO 10#####
pass

frame.sort_index()

         State  pop 2010  pop 2018  rev 2010  rev 2018    area  popchange
CA  California     37254     39557    112372    175017  163695   6.181887
MD    Maryland      5774      6043     17064     22427   12406   4.658815
NY    New York     19378     19542     71545     88541   54555   0.846321

**TODO 11**
Sort DataFrame `frame` by the 2018 population in descending order.

In [266]:
#####TODO 11#####
pass
frame.sort_index(by = 'pop 2018')

/Users/michaelruvio/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:3: FutureWarning: by argument to sort_index is deprecated, please use .sort_values(by=...)
  This is separate from the ipykernel package so we can avoid doing imports until

         State  pop 2010  pop 2018  rev 2010  rev 2018    area  popchange
MD    Maryland      5774      6043     17064     22427   12406   4.658815
NY    New York     19378     19542     71545     88541   54555   0.846321
CA  California     37254     39557    112372    175017  163695   6.181887

# TODO 12
Compute the total tax revenue across the three states in DataFrame `frame`.

In [267]:
####TODO 12####
pass

frame['Total tax Rev'] = (frame['rev 2010'] + frame['rev 2018'])
frame

,State,pop 2010,pop 2018,rev 2010,rev 2018,area,popchange,Total tax Rev
NY,New York,19378,19542,71545,88541,54555,0.846321,160086
CA,California,37254,39557,112372,175017,163695,6.181887,287389
MD,Maryland,5774,6043,17064,22427,12406,4.658815,39491

**TODO 13** In how many states did the tax reveue increase by at least 30%?

In [268]:
#####TODO 13#####
pass

frame['Tax Rev % increse'] = ((frame['rev 2018'] - frame['rev 2010']) / frame['rev 2018'] *100)
frame

#CA is above 30%

,State,pop 2010,pop 2018,rev 2010,rev 2018,area,popchange,Total tax Rev,Tax Rev % increse
NY,New York,19378,19542,71545,88541,54555,0.846321,160086,19.195627
CA,California,37254,39557,112372,175017,163695,6.181887,287389,35.793666
MD,Maryland,5774,6043,17064,22427,12406,4.658815,39491,23.913140

**TODO 14** 
Return the index of the row with the highest `popchange` value.

In [269]:
#####TODO 14#####
pass

frame.popchange.idxmax()

'CA'

**TODO 15**
Replace Maryland's `popchange` value by `np.NaN`. Then count the number of rows in the DataFrame with one or more missing values.

Hint: use methods `isnull()` and `any(axis = 1)`.

In [270]:
#####TODO 15#####
pass

frame.loc['MD','popchange'] = np.NaN
np.sum(frame.isnull(), axis = 1)

NY    0
CA    0
MD    1
dtype: int64